polpo/open-retro-storage-frontpanel/sw-frontpanel/sdkconfig.defaults
# Common sdkconfig defaults for all product variants

# The panel is an ESP32-C3. Pin it so a fresh build dir cannot default to
# plain esp32, which builds and links but cannot run on the hardware.
CONFIG_IDF_TARGET="esp32c3"

# Custom partition table with OTA support
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash configuration
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# HTTP server settings (larger buffers for web UI file uploads)
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# OTA rollback support
CONFIG_APP_ROLLBACK_ENABLE=y
